#！/bin/bash
#demo3:维护菜单选择
echo "*********welcome to uplooking*********"
echo "*********选择操作类型*******************"
echo "**********1——系统**********************"
echo "**********2——程序**********************"
echo "**********3——数据库********************"
echo "**********0——退出**********************"
read -p "请选择操作类型：" choose
case $choose in
    1)
    echo "你选择的类型是系统维护"
    ;;
    2)
    echo "你选择的是程序"
    ;;
    3)
    echo "*********welcome to uplooking*********"
    echo "*********选择操作类型*******************"
    echo "**********1——备份**********************"
    echo "**********2——数据导入导出****************"
    echo "**********0——退出**********************"
    read -p "请你输入对数据库的操作：" choose1
    case $choose1 in
        0)
        echo "退出"
        ;;
        1)
        echo "备份数据库"
        ;;
        2)
        echo "导入导出"
        ;;
        *)
        echo "你要干啥？"
        ;;
    esac
    ;;
    0)
    exit
    ;;
    *)
    echo "输入错误！"
    ;;
esac
